In [1]:
import numpy as np
import pandas as pnd

## Seriler

In [2]:
sozlugum={"atil":50,"zeynep":40,"efe":30}

In [4]:
pnd.Series(sozlugum)

atil      50
zeynep    40
efe       30
dtype: int64

In [6]:
yaslar=[50,40,30]
isimler=["atil","zeynep","efe"]

In [7]:
pnd.Series(yaslar)

0    50
1    40
2    30
dtype: int64

In [8]:
pnd.Series(yaslar,isimler)

atil      50
zeynep    40
efe       30
dtype: int64

In [9]:
pnd.Series(data=yaslar,index=isimler)

atil      50
zeynep    40
efe       30
dtype: int64

In [10]:
numpyDizi=np.array([50,40,30])

In [11]:
numpyDizi

array([50, 40, 30])

In [13]:
pnd.Series(numpyDizi,isimler)

atil      50
zeynep    40
efe       30
dtype: int32

In [14]:
pnd.Series(["kirmizi","yesil","mavi"],[1,2,3])

1    kirmizi
2      yesil
3       mavi
dtype: object

In [17]:
yarismaSonucu1=pnd.Series([10,5,1],["kirmizi","yesil","mavi"])

In [18]:
yarismaSonucu1

kirmizi    10
yesil       5
mavi        1
dtype: int64

In [19]:
yarismaSonucu2=pnd.Series([20,10,8],["kirmizi","yesil","mavi"])

In [20]:
yarismaSonucu2

kirmizi    20
yesil      10
mavi        8
dtype: int64

In [21]:
yarismaSonucu2["yesil"]

10

In [22]:
Toplamsonuc=yarismaSonucu1+yarismaSonucu2

In [23]:
Toplamsonuc

kirmizi    30
yesil      15
mavi        9
dtype: int64

## Data Frame

In [63]:
data=np.random.randn(4,3)

In [64]:
data

array([[ 1.39814538, -1.17418012,  1.77063725],
       [ 0.26232159,  1.80873579,  0.0024014 ],
       [-0.39678907,  1.75677459, -1.06951595],
       [-0.86512201, -1.22497302, -0.51622547]])

In [65]:
dataFrame=pnd.DataFrame(data)

In [66]:
dataFrame

          0         1         2
0  1.398145 -1.174180  1.770637
1  0.262322  1.808736  0.002401
2 -0.396789  1.756775 -1.069516
3 -0.865122 -1.224973 -0.516225

In [67]:
yeniDataFrame=pnd.DataFrame(data,index=["kirmizi","mavi","yesil","mor"],columns=["yas","maas","prim"])

In [68]:
yeniDataFrame

              yas      maas      prim
kirmizi  1.398145 -1.174180  1.770637
mavi     0.262322  1.808736  0.002401
yesil   -0.396789  1.756775 -1.069516
mor     -0.865122 -1.224973 -0.516225

In [69]:
yeniDataFrame["yas"]

kirmizi    1.398145
mavi       0.262322
yesil     -0.396789
mor       -0.865122
Name: yas, dtype: float64

In [70]:
yeniDataFrame[["maas","yas"]] #sadece istenilen bilgileri tabloda gösterme

             maas       yas
kirmizi -1.174180  1.398145
mavi     1.808736  0.262322
yesil    1.756775 -0.396789
mor     -1.224973 -0.865122

In [71]:
yeniDataFrame.loc["yesil"] # sadece istenilen satır yazdırılır

yas    -0.396789
maas    1.756775
prim   -1.069516
Name: yesil, dtype: float64

In [76]:
yeniDataFrame["EYT"]=yeniDataFrame["yas"]+yeniDataFrame["yas"]

In [77]:
yeniDataFrame

              yas      maas      prim       EYT
kirmizi  1.398145 -1.174180  1.770637  2.796291
mavi     0.262322  1.808736  0.002401  0.524643
yesil   -0.396789  1.756775 -1.069516 -0.793578
mor     -0.865122 -1.224973 -0.516225 -1.730244

In [78]:
yeniDataFrame.drop("EYT",axis=1) # "drop" satır,sütun silmeye yarar.

              yas      maas      prim
kirmizi  1.398145 -1.174180  1.770637
mavi     0.262322  1.808736  0.002401
yesil   -0.396789  1.756775 -1.069516
mor     -0.865122 -1.224973 -0.516225

In [80]:
boolFrame=yeniDataFrame > 0

In [81]:
boolFrame

           yas   maas   prim    EYT
kirmizi   True  False   True   True
mavi      True   True   True   True
yesil    False   True  False  False
mor      False  False  False  False

In [83]:
yeniDataFrame[boolFrame]

              yas      maas      prim       EYT
kirmizi  1.398145       NaN  1.770637  2.796291
mavi     0.262322  1.808736  0.002401  0.524643
yesil         NaN  1.756775       NaN       NaN
mor           NaN       NaN       NaN       NaN

In [84]:
ilkIndex=["simpson","simpson","simpson","south park","south park","south park"]

In [85]:
icIndex=["homer","bart","merge","cartman","kenny","kyle"]

In [86]:
birlesmisIndex=list(zip(ilkIndex,icIndex))

In [87]:
birlesmisIndex

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'merge'),
 ('south park', 'cartman'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [88]:
birlesmisIndex=pnd.MultiIndex.from_tuples(birlesmisIndex)

In [89]:
birlesmisIndex

MultiIndex([(   'simpson',   'homer'),
            (   'simpson',    'bart'),
            (   'simpson',   'merge'),
            ('south park', 'cartman'),
            ('south park',   'kenny'),
            ('south park',    'kyle')],
           )

In [94]:
cizgiFilmListe=[[40,"a"],[30,"b"],[10,"c"],[9,"d"],[14,"e"],[11,"f"]]

In [95]:
cizgiFilmNumpyDizi=np.array(cizgiFilmListe)

In [96]:
cizgiFilmDataFrame=pnd.DataFrame(cizgiFilmNumpyDizi,index=birlesmisIndex,columns=["yas","meslek"])

In [97]:
cizgiFilmDataFrame.loc["simpson"]

      yas meslek
homer  40      a
bart   30      b
merge  10      c

In [98]:
cizgiFilmDataFrame

                   yas meslek
simpson    homer    40      a
           bart     30      b
           merge    10      c
south park cartman   9      d
           kenny    14      e
           kyle     11      f

## Operasyonlar

In [99]:
sozluk={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38]}
havaDurumuDataFrame=pnd.DataFrame(sozluk)

In [100]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [101]:
havaDurumuDataFrame.dropna() # boşluk olan satırları düşürüyor

   istanbul  ankara  izmir
0      30.0    20.0     40

In [103]:
havaDurumuDataFrame.dropna(axis=1) # boşluk olan sütunları düşürüyor

   izmir
0     40
1     39
2     38

In [106]:
yenisozluk={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38],"antalya":[45,np.nan,np.nan]}
yenihavaDurumuDataFrame=pnd.DataFrame(yenisozluk)

In [107]:
yenihavaDurumuDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [109]:
yenihavaDurumuDataFrame.dropna(axis=1,thresh=2)

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

thresh, limit koyma anlamına gelir. thresh=2 dersek 2 ve üzeri NaN olanları göstermiyor.

In [111]:
yenihavaDurumuDataFrame.fillna(20) # boş olanları dolduruyor.

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Groupby

In [116]:
maasSozluk={"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
           "çalışan ismi":["mor","mavi","yeşil","sari","turuncu","kırmızı"],
           "maaş":[100,150,200,300,450,500]}

In [117]:
maasDataFrame=pnd.DataFrame(maasSozluk)

In [118]:
maasDataFrame

   departman çalışan ismi  maaş
0    yazılım          mor   100
1    yazılım         mavi   150
2  pazarlama        yeşil   200
3  pazarlama         sari   300
4      hukuk      turuncu   450
5      hukuk      kırmızı   500

In [120]:
grupObje=maasDataFrame.groupby("departman")

In [121]:
grupObje.count() # hangi departmanda kaç kişi çalıştığını görürüz.

           çalışan ismi  maaş
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [122]:
grupObje.mean() # departmandakilerin ortalama maaşlarını görürüz.

           maaş
departman
hukuk       475
pazarlama   250
yazılım     125

In [123]:
grupObje.min()

          çalışan ismi  maaş
departman
hukuk          kırmızı   450
pazarlama         sari   200
yazılım           mavi   100

In [124]:
grupObje.max()

          çalışan ismi  maaş
departman
hukuk          turuncu   500
pazarlama        yeşil   300
yazılım            mor   150

In [125]:
grupObje.describe()

           maaş
          count   mean        std    min    25%    50%    75%    max
departman
hukuk       2.0  475.0  35.355339  450.0  462.5  475.0  487.5  500.0
pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## Concat (tablo birleştirme)

In [127]:
sozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
         "spor":["koşu","yüzme","koşu","basketbol"],
        "kalori":[100,150,200,250]}

In [128]:
dataframe1=pnd.DataFrame(sozluk1,index=[0,1,2,3])

In [129]:
dataframe1

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     150
2  zeynep       koşu     200
3    atıl  basketbol     250

In [132]:
sozluk2={"isim":["osman","levent","atlas","fatma"],
         "spor":["koşu","yüzme","koşu","basketbol"],
        "kalori":[100,320,200,460]}

In [133]:
dataframe2=pnd.DataFrame(sozluk2,index=[4,5,6,7])

In [134]:
dataframe2

     isim       spor  kalori
4   osman       koşu     100
5  levent      yüzme     320
6   atlas       koşu     200
7   fatma  basketbol     460

concatenation

In [137]:
pnd.concat([dataframe1,dataframe2],axis=0)

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     150
2  zeynep       koşu     200
3    atıl  basketbol     250
4   osman       koşu     100
5  levent      yüzme     320
6   atlas       koşu     200
7   fatma  basketbol     460

## Merge

In [138]:
mergeSozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
              "spor":["koşu","yüzme","koşu","basketbol"],}

In [139]:
mergeDataFrame1=pnd.DataFrame(mergeSozluk1)

In [140]:
mergeDataFrame1

     isim       spor
0   ahmet       koşu
1  mehmet      yüzme
2  zeynep       koşu
3    atıl  basketbol

In [141]:
mergeSozluk2={"isim":["ahmet","mehmet","zeynep","atıl"],
              "kalori":[100,150,200,250]}

In [142]:
mergeDataFrame2=pnd.DataFrame(mergeSozluk2)

In [143]:
mergeDataFrame2

     isim  kalori
0   ahmet     100
1  mehmet     150
2  zeynep     200
3    atıl     250

In [144]:
pnd.merge(mergeDataFrame1,mergeDataFrame2,on="isim")

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     150
2  zeynep       koşu     200
3    atıl  basketbol     250

***************************************************

In [164]:
 maasSozluk={"isim":["atil","zeynep","mehmet","ahmet"],
            "departman":["yazılım","satış","pazarlama","yazılım"],
            "maas":[200,300,400,500]
            }

In [165]:
maasDataFrame=pnd.DataFrame(maasSozluk)

In [166]:
maasDataFrame

     isim  departman  maas
0    atil    yazılım   200
1  zeynep      satış   300
2  mehmet  pazarlama   400
3   ahmet    yazılım   500

In [167]:
maasDataFrame["departman"].nunique()

3

In [168]:
maasDataFrame["departman"].unique()

array(['yazılım', 'satış', 'pazarlama'], dtype=object)

In [169]:
maasDataFrame["departman"].value_counts()

yazılım      2
pazarlama    1
satış        1
Name: departman, dtype: int64

In [172]:
def bruttenNete(maas):
    return maas * 0.66

In [173]:
maasDataFrame["maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: maas, dtype: float64

In [175]:
maasDataFrame.isnull() # null değer var mı diye kontrol ediyor.

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## Pandas Excel

In [178]:
dataframe = pnd.read_excel("Kitap1.xlsx")

In [179]:
dataframe

  Unnamed: 0  maas   yas  departman
0       atıl   100  40.0    yazılım
1     zeynep   150  50.0      satış
2     mehmet   200  30.0        NaN
3      ahmet    50  10.0  pazarlama
4      atlas   150   NaN     finans
5      fatma   200  25.0      hukuk

In [181]:
doludegerler = dataframe.dropna()

In [182]:
doludegerler

  Unnamed: 0  maas   yas  departman
0       atıl   100  40.0    yazılım
1     zeynep   150  50.0      satış
3      ahmet    50  10.0  pazarlama
5      fatma   200  25.0      hukuk

In [183]:
doludegerler.to_excel("yeniexcel.xlsx")

 yeni excel oluşturup değiştirdiğimiz değerleri kaydetti